nanolith/rcpr/src/psock/psock_internal.h
/******************************************************************************/
/* Start of private exports.                                                  */
/******************************************************************************/
#define RCPR_IMPORT_psock_internal \
    RCPR_BEGIN_EXPORT \
    typedef RCPR_SYM(psock_from_descriptor) psock_from_descriptor; \
    typedef RCPR_SYM(psock_wrap_async) psock_wrap_async; \
    typedef RCPR_SYM(psock_from_buffer) psock_from_buffer; \
    typedef RCPR_SYM(psock_from_user_methods) psock_from_user_methods; \
    typedef RCPR_SYM(psock_output_buffer_node) psock_output_buffer_node; \
    typedef RCPR_SYM(psock_br) psock_br; \
    static inline status psock_from_descriptor_read( \
        RCPR_SYM(psock)* v, void* w, void* x, size_t* y, bool z) { \
            return RCPR_SYM(psock_from_descriptor_read)(v,w,x,y,z); } \
    static inline status psock_from_descriptor_write( \
        RCPR_SYM(psock)* w, void* x, const void* y, size_t* z) { \
            return RCPR_SYM(psock_from_descriptor_write)(w,x,y,z); } \
    static inline status psock_from_descriptor_accept( \
        RCPR_SYM(psock)* v, void* w, int* x, struct sockaddr* y, \
        socklen_t* z) { \
            return RCPR_SYM(psock_from_descriptor_accept)(v,w,x,y,z); } \
    static inline status psock_from_descriptor_setsockopt( \
        RCPR_SYM(psock)* u, void* v, int w, int x, const void* y, \
        socklen_t z) { \
            return RCPR_SYM(psock_from_descriptor_setsockopt)(u,v,w,x,y,z); } \
    static inline status psock_from_descriptor_release( \
        RCPR_SYM(resource)* x) { \
            return RCPR_SYM(psock_from_descriptor_release)(x); } \
    static inline status psock_wrap_async_read( \
        RCPR_SYM(psock)* v, void* w, void* x, size_t* y, bool z) { \
            return RCPR_SYM(psock_wrap_async_read)(v,w,x,y,z); } \
    static inline status psock_wrap_async_write( \
        RCPR_SYM(psock)* w, void* x, const void* y, size_t* z) { \
             return RCPR_SYM(psock_wrap_async_write)(w,x,y,z); } \
    static inline status psock_wrap_async_accept( \
        RCPR_SYM(psock)* v, void* w, int* x, struct sockaddr* y, \
        socklen_t* z) { \
            return RCPR_SYM(psock_wrap_async_accept)(v,w,x,y,z); } \
    static inline status psock_fiber_scheduler_discipline_create( \
        RCPR_SYM(fiber_scheduler_discipline)** w, RCPR_SYM(resource)** x, \
        RCPR_SYM(fiber_scheduler)* y, RCPR_SYM(allocator)* z) { \
            return \
                RCPR_SYM(psock_fiber_scheduler_discipline_create)(w,x,y,z); } \
    static inline status \
    psock_fiber_scheduler_disciplined_read_wait_callback_handler( \
        void* w, RCPR_SYM(fiber)* x, int y, void* z) { \
          return \
            RCPR_SYM( \
              psock_fiber_scheduler_disciplined_read_wait_callback_handler)( \
                w,x,y,z); } \
    static inline status \
    psock_fiber_scheduler_disciplined_write_wait_callback_handler( \
        void* w, RCPR_SYM(fiber)* x, int y, void* z) { \
          return \
            RCPR_SYM( \
              psock_fiber_scheduler_disciplined_write_wait_callback_handler)( \
                w,x,y,z); } \
    static inline status psock_idle_fiber_entry( \
        void* x) { \
            return RCPR_SYM(psock_idle_fiber_entry)(x); } \
    static inline status psock_fiber_scheduler_discipline_context_create( \
        RCPR_SYM(resource)** x, RCPR_SYM(fiber_scheduler)* y, \
        RCPR_SYM(allocator)* z) { \
            return RCPR_SYM(psock_fiber_scheduler_discipline_context_create)( \
                x,y,z); } \
    static inline void psock_fiber_scheduler_discipline_set_resource_release( \
        RCPR_SYM(fiber_scheduler_discipline)* x, RCPR_SYM(resource)* y) { \
            RCPR_SYM(psock_fiber_scheduler_discipline_set_resource_release)( \
                x,y); } \
    static inline status psock_from_buffer_read( \
        RCPR_SYM(psock)* v, void* w, void* x, size_t* y, bool z) { \
            return RCPR_SYM(psock_from_buffer_read)(v,w,x,y,z); } \
    static inline status psock_from_buffer_write( \
        RCPR_SYM(psock)* w, void* x, const void* y, size_t* z) { \
            return RCPR_SYM(psock_from_buffer_write)(w,x,y,z); } \
    static inline status psock_from_buffer_accept( \
        RCPR_SYM(psock)* v, void* w, int* x, struct sockaddr* y, \
        socklen_t* z) { \
            return RCPR_SYM(psock_from_buffer_accept)(v,w,x,y,z); } \
    static inline status psock_from_buffer_release( \
        RCPR_SYM(resource)* x) { \
            return RCPR_SYM(psock_from_buffer_release)(x); } \
    static inline status psock_from_descriptor_sendmsg( \
        RCPR_SYM(psock)* w, void* x, const struct msghdr* y, int z) { \
            return RCPR_SYM(psock_from_descriptor_sendmsg)(w,x,y,z); } \
    static inline status psock_from_descriptor_recvmsg( \
        RCPR_SYM(psock)* v, void* w, struct msghdr* x, size_t* y, int z) { \
            return RCPR_SYM(psock_from_descriptor_recvmsg)(v, w,x,y,z); } \
    static inline status psock_wrap_async_sendmsg( \
        RCPR_SYM(psock)* w, void* x, const struct msghdr* y, int z) { \
            return RCPR_SYM(psock_wrap_async_sendmsg)(w,x,y,z); } \
    static inline status psock_wrap_async_recvmsg( \
        RCPR_SYM(psock)* v, void* w, struct msghdr* x, size_t* y, int z) { \
            return RCPR_SYM(psock_wrap_async_recvmsg)(v,w,x,y,z); } \
    static inline status psock_br_psock_read( \
        RCPR_SYM(psock)* v, void* w, void* x, size_t* y, bool z) { \
            return RCPR_SYM(psock_br_psock_read)(v,w,x,y,z); } \
    static inline status psock_br_psock_write( \
        RCPR_SYM(psock)* w, void* x, const void* y, size_t* z) { \
            return RCPR_SYM(psock_br_psock_write)(w,x,y,z); } \
    static inline status psock_br_psock_accept( \
        RCPR_SYM(psock)* v, void* w, int* x, struct sockaddr* y, \
        socklen_t* z) { \
            return RCPR_SYM(psock_br_psock_accept)(v,w,x,y,z); } \
    static inline status psock_br_psock_sendmsg( \
        RCPR_SYM(psock)* w, void* x, const struct msghdr* y, int z) { \
            return RCPR_SYM(psock_br_psock_sendmsg)(w,x,y,z); } \
    static inline status psock_br_psock_recvmsg( \
        RCPR_SYM(psock)* v, void* w, struct msghdr* x, size_t* y, int z) { \
            return RCPR_SYM(psock_br_psock_recvmsg)(v,w,x,y,z); } \
    static inline status psock_br_fill( \
        RCPR_SYM(psock_br)* x) { \
            return RCPR_SYM(psock_br_fill)(x); }\
    static inline status psock_br_release( \
        RCPR_SYM(resource)* x) { \
            return RCPR_SYM(psock_br_release)(x); } \
    RCPR_END_EXPORT \
    REQUIRE_SEMICOLON_HERE

/* C++ compatibility. */
# ifdef   __cplusplus
}
# endif /*__cplusplus*/
